---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ProfileFailures
source: html/e1d10acb-9e9f-e395-e010-0c413e19d1fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ProfileFailures

Failures about Profile.

## Syntax (C#)
```csharp
public static class ProfileFailures
```